rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 9]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Ralph Lauren"]]
---
  def same_director
    id = params[:id]
    movie = Movie.find(id)
    if movie.director.nil? or movie.director.empty?